package com.example;

import java.io.BufferedReader;
import java.io.DataInputStream;
import java.io.File;
import java.io.FileInputStream;
import java.io.FileNotFoundException;
import java.io.IOException;
import java.io.InputStreamReader;
import java.util.ArrayList;
import java.util.List;

public class MyClass_import {

    static int row = 0;
    static int question_row = 0;
    static int Positive_row = 0;
    static int Negative_row = 0;
    static String theme = "", question = "", negative_answer = "", right_answer = "";
    static String Question_is = "";
    static ArrayList<String> NAnswers = new ArrayList();
    static String RAnswer = "";
    static boolean next_title = false;
    static boolean next_themes = false;
    static String filepath2 = "У якому шарі атмосфери знаходиться  практично уся водяна пара, при конденсації якої утворюються хмари і опади? \n" +
            "а) стратосфера;\n" +
            "б) мезосфера;\n" +
            "в) тропосфера;\n" +
            "г) термосфера.\n" +
            "в) тропосфера\n" +
            "\n" +
            "Що називається тропопаузою?\n" +
            "а) це перехідний шар між шаром тертя та вільною атмосферою;\n" +
            "б) це шар повітря, температура повітря в якому залишається незмінною; \n" +
            "в) це перехідний шар між тропосферою та мезосферою;\n" +
            "г) це перехідний шар між тропосферою та стратосферою.\n" +
            "г) перехідний шар між тропосферою та стратосферою\n" +
            "\n" +
            "Що найбільше впливає на погодні умови в нижньому шарі тропосфери?\n" +
            "а) підстильна поверхня;\n" +
            "б) конденсація водяного пару;\n" +
            "в) перемішування повітря внаслідок турбулентності;\n" +
            "г) запиленість повітря.\n" +
            "а) підстильна поверхня\n" +
            "\n" +
            "\n";
    private final Object LOG_TAG = "LOG_IMPORT";

    public static void main(String[] arg) {
        String filePath = "Колір випромінювання бічних вогнів ЗПС такий\n" +
                "+Білий та жовтий\n" +
                "Зелений та білий\n" +
                "Червоний\n" +
                "Синій\n" +
                "\n" +
                "Довжина вогнів ЗПС жовтого кольору така\n" +
                "+600 m\n" +
                "300 m\n" +
                "100 m\n" +
                "60 m\n" +
                "\n" +
                "Відносно ЗПС08 вогні візуальної індикації глісади (PAPI) знаходяться\n" +
                "+Ліворуч\n" +
                "Праворуч\n" +
                "На NDB\n" +
                "На VOR/DME\n" +
                "\n" +
                "Вогні візуальної індикації глісади (PAPI) ЗПС08 розташовані на відстані ______  метрів від порогу ЗПС\n" +
                "+296 m\n" +
                "200 m\n" +
                "90 m\n" +
                "60 m\n" +
                "\n" +
                "Кут нахилу вогнів візуальної індикації глісади (PAPI) ЗПС08 становить\n" +
                "+2,8°\n" +
                "3,8°\n" +
                "5,0°\n" +
                "2,0°\n" +
                "\n" +
                "Кут нахилу вогнів візуальної індикації глісади (PAPI) ЗПС26 становить\n" +
                "+3,0°\n" +
                "2,0°\n" +
                "3,8°\n" +
                "1,8°\n" +
                "\n" +
                "Загальна довжина лінії бічних вогнів ЗПС08/26 складає\n" +
                "+2858 m\n" +
                "3058 m\n" +
                "2800 m\n" +
                "2500 m\n" +
                "\n" +
                "Колір вогнів порогу ЗПС08 такий\n" +
                "+Зелений\n" +
                "Синій\n" +
                "Білий\n" +
                "Червоний\n" +
                "\n" +
                "Колір обмежувальних вогнів ЗПС26 такий\n" +
                "+Червоний\n" +
                "Зелений\n" +
                "Синій\n" +
                "Білий\n" +
                "\n" +
                "Колір вогнів осьової лінії ЗПС08/26 такий\n" +
                "+Відсутні\n" +
                "Зелений\n" +
                "Синій\n" +
                "Білий\n" +
                "\n" +
                "Інтервал між бічними вогнями ЗПС08/26 становить\n" +
                "+60 m\n" +
                "50 m\n" +
                "70 m\n" +
                "90 m";
        //readFileSD_Meteo(filepath2);
        // readFileSD(filePath);
        String filepathold =

        "###TITLE###\n" +
                "DVW+DVE.Структура повітряного простору.\n" +
                "\n" +
                "\n" +
                "###THEMES###\n" +
                "DVW+DVE.Структура повітряного простору.\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Які класи повітряного простору встановлені у повітряному просторі України\n" +
                "+\n" +
                " С, D, G;\n" +
                "-\n" +
                " A, C, D;\n" +
                "-\n" +
                " B, C, D, F;\n" +
                "-\n" +
                " G;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "З якими РДЦ межує сектор DVW + DVE?\n" +
                "+\n" +
                " Київський РДЦ, Одеський РДЦ, РДЦ Ростов-на-Дону;\n" +
                "-\n" +
                " DVC, DVN, DVS+DVB;\n" +
                "-\n" +
                " РДЦ Москва, РДЦ Київ;\n" +
                "-\n" +
                " всі зазначені;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Яке скорочення встановлено для терміну диспетчерський район (control area)?\n" +
                "+\n" +
                " CTA;\n" +
                "-\n" +
                " CTR;\n" +
                "-\n" +
                " FIR;\n" +
                "-\n" +
                " TMA;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Яке скорочення встановлено для терміну район польотної інформації (flight information region)\n" +
                "+\n" +
                " FIR;\n" +
                "-\n" +
                " CTR;\n" +
                "-\n" +
                " TMA;\n" +
                "-\n" +
                " CTA;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Для FL275 - FL660 у повітряному просторі UIR Kyiv встановлені такі класи…\n" +
                "+\n" +
                " Клас С;\n" +
                "-\n" +
                " C, D, E;\n" +
                "-\n" +
                " A;\n" +
                "-\n" +
                " некласифікований ПП;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Яке скорочення встановлено для терміну тимчасово зарезервована зона (temporary reserved area)?\n" +
                "+\n" +
                " TRA;\n" +
                "-\n" +
                " TSA;\n" +
                "-\n" +
                " FBZ;\n" +
                "-\n" +
                " UKP;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Сектор DVW може об'єднуватись із сектором DVE на робочому місці...\n" +
                "+\n" +
                " DVE;\n" +
                "-\n" +
                " DVT;\n" +
                "-\n" +
                " DVN;\n" +
                "-\n" +
                " DVC;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Яка верхня межа встановлена для зони UKR456 Pavlohrad\n" +
                "+\n" +
                " UNL;\n" +
                "-\n" +
                " FL350;\n" +
                "-\n" +
                " FL105;\n" +
                "-\n" +
                " FL600;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Яка верхня межа встановлена для зони UKT707D Zaporizhzhia\n" +
                "+\n" +
                " FL470;\n" +
                "-\n" +
                " TFL;\n" +
                "-\n" +
                " FL110;\n" +
                "-\n" +
                " 3050M;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Які значення DFL для секторів DVC/DVW можуть бути встановлені\n" +
                "+\n" +
                " FL325 / 335 / 345 / 355;\n" +
                "-\n" +
                " FL325;\n" +
                "-\n" +
                " FL150/FL160;\n" +
                "-\n" +
                " FL120;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Яке скорочення встановлено для терміну тимчасово відокремлена зона (temporary segregated area)?\n" +
                "+\n" +
                " TSA;\n" +
                "-\n" +
                " TRA;\n" +
                "-\n" +
                " FBZ;\n" +
                "-\n" +
                " UKP;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Який буфер встановлюється навколо заборонених зон, у яких не передбачено діяльність із використання повітряного простору?\n" +
                "+\n" +
                " буфер не встановлюється;\n" +
                "-\n" +
                " 5 NM (9,3 km);\n" +
                "-\n" +
                " 2,7 NM (5 km);\n" +
                "-\n" +
                " 1,1 NM (2 km);\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Значення DFL для секторів DVC/DVW встановлюється за рішенням \n" +
                "+\n" +
                " КП РДЦ;\n" +
                "-\n" +
                " Повноважного органу Державіаслужби;\n" +
                "-\n" +
                " МКК Украероруху;\n" +
                "-\n" +
                " диспетчера УПР;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Що установлюється для забезпечення безпеки при виконанні польотів та плануванні використання повітряного простору навколо заборонених зон, зон обмеження польотів, небезпечних зон та зон тимчасово зарезервованого повітряного простору?\n" +
                "+\n" +
                " Буфер;\n" +
                "-\n" +
                " CTR;\n" +
                "-\n" +
                " TMA;\n" +
                "-\n" +
                " FIZ;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Точками передавання контролю між секторами  DVW та DVE є ...\n" +
                "+\n" +
                " KOSIR, BULIG, TAGAN, TOKMU;\n" +
                "-\n" +
                " FASAD, TAMAK;\n" +
                "-\n" +
                " OLGIN, FASAD;\n" +
                "-\n" +
                " PEKIT, DEKAD, AKULO;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Точками передавання контролю між секторами  DVW та DVS є ...\n" +
                "+\n" +
                " TADID, DITIX, ROLOP;\n" +
                "-\n" +
                " PEKIT, DEKAD, AKULO;\n" +
                "-\n" +
                " KOSIR, BULIG, TAGAN, TOKMU;\n" +
                "-\n" +
                " BADIG, ROKOX;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Точками передавання контролю між секторами  DVW та UTA/CTA Kyiv BVN є ...\n" +
                "+\n" +
                " PEKIT, TADID, AKULO;\n" +
                "-\n" +
                " FASAD, TAMAK;\n" +
                "-\n" +
                " DNP, ORSUS;\n" +
                "-\n" +
                " KESAM;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Точками передавання контролю між секторами  DVW та UTA/CTA Kyiv BVO є ...\n" +
                "+\n" +
                " LORDU, REPLI, GODOD;\n" +
                "-\n" +
                " FASAD, TAMAK;\n" +
                "-\n" +
                " KESAM;\n" +
                "-\n" +
                " ROKOX, BADIG;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Точка передавання контролю між сектором DVW та UTA/CTA Odessa North OVN\n" +
                "+\n" +
                " KESAM;\n" +
                "-\n" +
                " ORSUS;\n" +
                "-\n" +
                " KVR;\n" +
                "-\n" +
                " DNP;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Точки ROKOX, KUBUL, NIKAD є точками передавання контролю між секторами DVW та\n" +
                "+\n" +
                " DVN;\n" +
                "-\n" +
                " BVN;\n" +
                "-\n" +
                " BVS;\n" +
                "-\n" +
                " DVS;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Який буфер установлюється в горизонтальній площині у випадках, коли в зазначених зонах проводяться пуски ракет, (окрім протитанкових керованих ракет) у тому числі з метою здійснення впливу на гідрометеорологічні процеси, використовуються реактивні системи залпового вогню та/або виконуються польоти ACFT з приладними швидкостями більше ніж 300 км/год?\n" +
                "+\n" +
                " 5 NM (9,3 км);\n" +
                "-\n" +
                " буфер не встановлюється;\n" +
                "-\n" +
                " 2,7 NM (5 км);\n" +
                "-\n" +
                " 1,1 NM (2 km);\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Який буфер установлюється в горизонтальній площині у випадках, коли в зазначених зонах проводяться усі види стрільб, пуски протитанкових керованих ракет, застосовуються вибухові пристрої військового призначення, знешкодження боєприпасів шляхом їх підриву, та/або виконуються польоти ACFT з приладними швидкостями 300 км/год або менше?\n" +
                "+\n" +
                " 2,7 NM (5 км);\n" +
                "-\n" +
                " буфер не встановлюється;\n" +
                "-\n" +
                " 5 NM (9,3 км);\n" +
                "-\n" +
                " 1,1 NM (2 km);\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Які аеродроми знаходяться в горизонтальних межах сектору DVW\n" +
                "+\n" +
                " Дніпропетровськ, Запоріжжя, Кривий Ріг;\n" +
                "-\n" +
                " Харків, Полтава;\n" +
                "-\n" +
                " Мелітополь, Запоріжжя;\n" +
                "-\n" +
                " Дніпро, Кропивницький;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "В межах сектору DVW дозволені польоти...\n" +
                "+\n" +
                " Тільки за ППП;\n" +
                "-\n" +
                " За ППП та ПВП;\n" +
                "-\n" +
                " За ППП тільки вище FL330;\n" +
                "-\n" +
                " За ППП та за ПВП тільки вдень;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Яке позначення має VOR/DME Dnipro\n" +
                "+\n" +
                " DNP;\n" +
                "-\n" +
                " DPR;\n" +
                "-\n" +
                " DNIP;\n" +
                "-\n" +
                " DNO;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Яке позначення має VOR/DME Kharkiv\n" +
                "+\n" +
                " KHR;\n" +
                "-\n" +
                " KRK;\n" +
                "-\n" +
                " KHAR;\n" +
                "-\n" +
                " HAR;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Яке позначення має DME Kryvyi Rih\n" +
                "+\n" +
                " KVR;\n" +
                "-\n" +
                " KR;\n" +
                "-\n" +
                " KRO;\n" +
                "-\n" +
                " KRVB;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Які зони очікування опубліковані для сектору DVW\n" +
                "+\n" +
                " не опубліковані;\n" +
                "-\n" +
                " DNP;\n" +
                "-\n" +
                " ROKOX, ORSUS;\n" +
                "-\n" +
                " BULIG;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "У повітряному просторі вище FL275 обслуговування повітряного руху здійснюється\n" +
                "+\n" +
                " виключно англійською мовою;\n" +
                "-\n" +
                " російською та англійською мовами;\n" +
                "-\n" +
                " будь-якою мовою;\n" +
                "-\n" +
                " тільки російською мовою;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Який буфер установлюється в горизонтальній площині у випадках, коли в зазначених зонах виконуються вибухові роботи?\n" +
                "+\n" +
                " 1,1 NM (2 km);\n" +
                "-\n" +
                " буфер не встановлюється;\n" +
                "-\n" +
                " 5 NM (9,3 км);\n" +
                "-\n" +
                " 2,7 NM (5 км);\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Чи використовуються схеми P-RNAV для польотів ПС з посадкою на а/д Харків\n" +
                "+\n" +
                " так;\n" +
                "-\n" +
                " не застосовуються;\n" +
                "-\n" +
                " тільки для ПВП;\n" +
                "-\n" +
                " тільки за узгодженням з Украероцентром;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Чи використовуються схеми P-RNAV для польотів ПС з посадкою на а/д Запоріжжя\n" +
                "+\n" +
                " ні;\n" +
                "-\n" +
                " застосовуються за умови наявності ILS;\n" +
                "-\n" +
                " тільки для візуального заходження на посадку;\n" +
                "-\n" +
                " так;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Чи використовуються схеми P-RNAV для польотів ПС з посадкою на а/д UKDD\n" +
                "+\n" +
                " так;\n" +
                "-\n" +
                " не застосовуються;\n" +
                "-\n" +
                " тільки для ПВП;\n" +
                "-\n" +
                " тільки за узгодженням з TWR DNIPRO;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Чи застосовуються процедури RVSM у ПП сектору DVW\n" +
                "+\n" +
                " так;\n" +
                "-\n" +
                " тільки вище FL410;\n" +
                "-\n" +
                " не застосовуються;\n" +
                "-\n" +
                " тільки для державних ПС;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Яка верхня межа застосування процедури RVSM?\n" +
                "+\n" +
                " FL410;\n" +
                "-\n" +
                " DFL;\n" +
                "-\n" +
                " TFL;\n" +
                "-\n" +
                " FL660;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Точки передавання контролю між об'єднаним сектором DVW+DVE та сектором Sector R1 Rostov-na-Donu ACC\n" +
                "+\n" +
                " FASAD, TAMAK;\n" +
                "-\n" +
                " GONED;\n" +
                "-\n" +
                " LORDU, REPLI;\n" +
                "-\n" +
                " PEKIT, DEKAD;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Чи є ПП сектору DVW частиною простору FRA?\n" +
                "+\n" +
                " так;\n" +
                "-\n" +
                " тільки вище FL390;\n" +
                "-\n" +
                " за рішенням КП РДЦ;\n" +
                "-\n" +
                " ні;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Яке відношення до FRA може мати навігаційна точка?\n" +
                "+\n" +
                " E, X, I, A, D, N/A;\n" +
                "-\n" +
                " E, X;\n" +
                "-\n" +
                " PR, VI;\n" +
                "-\n" +
                " APP, ACC;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Що означає літера E у відношенні до FRA навігаційної точки?\n" +
                "+\n" +
                " точка входу в ПП FRA;\n" +
                "-\n" +
                " проміжна точка;\n" +
                "-\n" +
                " остання точка;\n" +
                "-\n" +
                " DCT;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Що означає літера X у відношенні до FRA навігаційної точки?\n" +
                "+\n" +
                " точка виходу з ПП FRA;\n" +
                "-\n" +
                " заданий ешелон;\n" +
                "-\n" +
                " початок STAR;\n" +
                "-\n" +
                " точка без обмежень;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Що означає літера I у відношенні до FRA навігаційної точки?\n" +
                "+\n" +
                " проміжна точка ПП FRA;\n" +
                "-\n" +
                " перша точка;\n" +
                "-\n" +
                " не відноситься до FRA;\n" +
                "-\n" +
                " основна точка;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Що означає літера A у відношенні до FRA навігаційної точки?\n" +
                "+\n" +
                " точка прибуття на аеродром в ПП FRA;\n" +
                "-\n" +
                " виходу із ПП;\n" +
                "-\n" +
                " точка координації;\n" +
                "-\n" +
                " аеродромна точка;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Що означає літера D у відношенні до FRA навігаційної точки?\n" +
                "+\n" +
                " точка вильоту з аеродрому з ПП FRA;\n" +
                "-\n" +
                " початкова точка;\n" +
                "-\n" +
                " прольотна точка;\n" +
                "-\n" +
                " заборонена точка;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "В межах яких ешелонів використовується скорочений мінімум вертикального ешелонування RVSM?\n" +
                "+\n" +
                " FL290-FL410;\n" +
                "-\n" +
                " FL110-FL130;\n" +
                "-\n" +
                " FL250-FL660;\n" +
                "-\n" +
                " 2900M - FL350;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Який буфер установлюється в вертикальній площині  вище верхньої межі  заборонених зон, зон обмеження польотів, небезпечних зон та зон тимчасово зарезервованого повітряного простору та/або нижче нижньої межі зони, якщо нижня межа встановлюється не від земної поверхні?\n" +
                "+\n" +
                " 300m;\n" +
                "-\n" +
                " 600m;\n" +
                "-\n" +
                " 900m;\n" +
                "-\n" +
                " 1200m;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Яке значення RNP втановлено для маршрутів ОПР вище FL275\n" +
                "+\n" +
                " RNP-5;\n" +
                "-\n" +
                " RNP-1;\n" +
                "-\n" +
                " P-RNAV;\n" +
                "-\n" +
                " ДПРМ;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "З яким сектором може об'єднуватись сектор UTA/CTA Kyiv BVN?\n" +
                "+\n" +
                " з сектором UTA/CTA Kyiv BVM;\n" +
                "-\n" +
                " з сектором BVO;\n" +
                "-\n" +
                " DVT;\n" +
                "-\n" +
                " DVW+DVE;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "З яким сектором може об'єднуватись сектор UTA/CTA Kyiv BVO?\n" +
                "+\n" +
                " з сектором UTA/CTA Kyiv BVS;\n" +
                "-\n" +
                " DVC;\n" +
                "-\n" +
                " APP+ACC;\n" +
                "-\n" +
                " UKDV;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Дайте визначення терміну заборонена зона:\n" +
                "+\n" +
                " частина повітряного простору встановлених розмірів над територією або територіальними водами України, у межах якої (яких) польоти ПС заборонені;\n" +
                "-\n" +
                " частина повітряного простору встановлених розмірів над територією або територіальними водами України, в межах якої (яких) польоти повітряних суден обмежуються відповідно до визначених умов;\n" +
                "-\n" +
                " частина повітряного простору визначеного розміру, у межах якої може провадитися діяльність, що є небезпечною для польотів повітряних суден у визначені періоди;\n" +
                "-\n" +
                " контрольований повітряний простір, що простягається вгору від межі, установленої над земною поверхнею, до встановленої верхньої межі;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Дайте визначення терміну зона обмеження польотів?\n" +
                "+\n" +
                " частина повітряного простору встановлених розмірів над територією або територіальними водами України, в межах якої (яких) польоти повітряних суден обмежуються відповідно до визначених умов;\n" +
                "-\n" +
                " частина повітряного простору встановлених розмірів над територією або територіальними водами України, у межах якої (яких) польоти ПС заборонені;\n" +
                "-\n" +
                " частина повітряного простору визначеного розміру, у межах якої може провадитися діяльність, що є небезпечною для польотів повітряних суден у визначені періоди;\n" +
                "-\n" +
                " контрольований повітряний простір, що простягається вгору від межі, установленої над земною поверхнею, до встановленої верхньої межі;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Як називається частина повітряного простору навколо зон обмеження польотів, небезпечних зон, заборонених зон та зон тимчасово зарезервованого повітряного простору, яка призначена для забезпечення подання діючого плану польоту за ППП, коли зазначені зони активовані або заплановані до активації?\n" +
                "+\n" +
                " буферна зона для планування польотів (FBZ);\n" +
                "-\n" +
                " частина повітряного простору встановлених розмірів над територією або територіальними водами України, у межах якої (яких) польоти ПС заборонені;\n" +
                "-\n" +
                " частина повітряного простору навколо зон обмеження польотів, небезпечних зон, заборонених зон та зон тимчасово зарезервованого повітряного простору, яка призначена для забезпечення вимог щодо безпеки у разі одночасного провадження діяльності з ВПП у зазначених зонах та поза їх межами;\n" +
                "-\n" +
                " контрольований повітряний простір, що простягається вгору від межі, установленої над земною поверхнею, до встановленої верхньої межі;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "При виконанні польотів в ПП FRA, який дескриптор встановлюється між точками маршруту в FPL\n" +
                "+\n" +
                " DCT;\n" +
                "-\n" +
                " ACT;\n" +
                "-\n" +
                " LAM;\n" +
                "-\n" +
                " PROCEED;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Які точки передавання контролю встановлені від сектора DVW+DVE в сектор DVC\n" +
                "+\n" +
                " На маршрутах ОПР та поза маршрутами  в горизонтальних межах району відповідальності секторів DVC та DVW+DVE FL330/340/350/360 (залежно від значення DFL) для подальшого зниження ПС;\n" +
                "-\n" +
                " За рішенням КП РДЦ;\n" +
                "-\n" +
                " BULIG, KOSIR;\n" +
                "-\n" +
                " не встановлено;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Які точки передавання контролю встановлені від сектора DVC в сектор DVW+DVE\n" +
                "+\n" +
                " На маршрутах ОПР та поза маршрутами  в горизонтальних межах району відповідальності секторів DVC та DVW+DVE FL320/330/340/350 (залежно від значення DFL) для подальшого набирання вищих FL;\n" +
                "-\n" +
                " За рішенням КП РДЦ;\n" +
                "-\n" +
                " TARAS, RUBES;\n" +
                "-\n" +
                " не встановлено;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Вище FL410 встановлено такий мінімальний вертикальний інтервал\n" +
                "+\n" +
                " 2000ft (600M);\n" +
                "-\n" +
                " 4000ft;\n" +
                "-\n" +
                " 1000ft (300M);\n" +
                "-\n" +
                " 60ft (200M);\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Який мінімальний вертикальний інтервал має бути забезпечений між державним ПС, незатвердженим до польотів в ПП RVSM та іншими ПС, допущених до польотів RVSM у ПП RVSM?\n" +
                "+\n" +
                " 2000ft (600M);\n" +
                "-\n" +
                " 1000ft (300M);\n" +
                "-\n" +
                " 2500ft;\n" +
                "-\n" +
                " 5000ft (1500M);\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00 \n" +
                "Дайте визначення терміну буфер?\n" +
                "+\n" +
                " частина повітряного простору навколо зон обмеження польотів, небезпечних зон, заборонених зон та зон тимчасово зарезервованого повітряного простору, яка призначена для забезпечення вимог щодо безпеки у разі одночасного провадження діяльності з ВПП у зазначених зонах та поза їх межами;\n" +
                "-\n" +
                " частина повітряного простору встановлених розмірів над територією або територіальними водами України, у межах якої (яких) польоти ПС заборонені;\n" +
                "-\n" +
                " частина повітряного простору встановлених розмірів над територією або територіальними водами України, в межах якої (яких) польоти повітряних суден обмежуються відповідно до визначених умов;\n" +
                "-\n" +
                " частина повітряного простору визначеного розміру, у межах якої може провадитися діяльність, що є небезпечною для польотів повітряних суден у визначені періоди;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Дайте визначення терміну диспетчерський район:\n" +
                "+\n" +
                " контрольований повітряний простір, що простягається вгору від межі, установленої над земною поверхнею, до встановленої верхньої межі;\n" +
                "-\n" +
                " частина повітряного простору визначеного розміру, у межах якої може провадитися діяльність, що є небезпечною для польотів повітряних суден у визначені періоди;\n" +
                "-\n" +
                " частина повітряного простору встановлених розмірів над територією або територіальними водами України, у межах якої (яких) польоти ПС заборонені;\n" +
                "-\n" +
                " частина повітряного простору встановлених розмірів над територією або територіальними водами України, в межах якої (яких) польоти повітряних суден обмежуються відповідно до визначених умов;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Який горизонтальний інтервал встановлюється для тренувальних зон UKT..., якщо в них проводяться польоти повітряних суден з приладними швидкостями більш ніж 300 км/год.\n" +
                "+\n" +
                " 9,3 км (5 NM);\n" +
                "-\n" +
                " 10 NM;\n" +
                "-\n" +
                " 1.2 NM;\n" +
                "-\n" +
                " не застосовується;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Який вертикальний інтервал встановлюється для тренувальних зон UKT..., якщо в них проводяться польоти повітряних суден з приладними швидкостями більш ніж 300 км/год.\n" +
                "+\n" +
                " 1000ft (300M);\n" +
                "-\n" +
                " 2000ft (600M);\n" +
                "-\n" +
                " 500ft;\n" +
                "-\n" +
                " не встановлено;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Який мінімум горизонтального ешелонування застосовується у межах сектору DVW+DVE?\n" +
                "+\n" +
                " 10 NM;\n" +
                "-\n" +
                " 20КМ;\n" +
                "-\n" +
                " 5 NM;\n" +
                "-\n" +
                " 11 NM;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Які види обслуговування надаються органом УПР в ПП класу С?\n" +
                "+\n" +
                " диспетчерське, польотно-інформаційне та аварійне;\n" +
                "-\n" +
                " польотно-інформаційне та аварійне;\n" +
                "-\n" +
                " конусльтативне та аварійне;\n" +
                "-\n" +
                " тільки польотно-інформаційне;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Які значення робочої ЗПС встановлені на аеродромі UKDD?\n" +
                "+\n" +
                " 08/26;\n" +
                "-\n" +
                " 18/36;\n" +
                "-\n" +
                " 05;\n" +
                "-\n" +
                " 33/15;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Які значення робочої ЗПС встановлені на аеродромі Харків?\n" +
                "+\n" +
                " 07/25;\n" +
                "-\n" +
                " 09/27;\n" +
                "-\n" +
                " 02/20;\n" +
                "-\n" +
                " 18R/36L;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Які значення робочої ЗПС встановлені на аеродромі Запоріжжя?\n" +
                "+\n" +
                " 02R/20L та 02L/20R;\n" +
                "-\n" +
                " 08/26;\n" +
                "-\n" +
                " 19/37;\n" +
                "-\n" +
                " 36R/18L, 36L/18R;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Які значення робочої ЗПС встановлені на аеродромі Кривий Ріг?\n" +
                "+\n" +
                " 18/36;\n" +
                "-\n" +
                " 03/21;\n" +
                "-\n" +
                " 005;\n" +
                "-\n" +
                " 01/19;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Який метод координації вважається основним для здійснення координації між секторами DVW+DVE та секторами Київського РДЦ?\n" +
                "+\n" +
                " OLDI;\n" +
                "-\n" +
                " резервний;\n" +
                "-\n" +
                " через екіпаж ПС;\n" +
                "-\n" +
                " всі зазначені;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Який метод координації вважається основним для здійснення координації між секторами DVW+DVE та секторами Одеського РДЦ?\n" +
                "+\n" +
                " OLDI;\n" +
                "-\n" +
                " резервний;\n" +
                "-\n" +
                " через екіпаж ПС;\n" +
                "-\n" +
                " всі зазначені;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Чи можуть застосовуватись процедури FRA у межах UTA Dnipro-South?\n" +
                "+\n" +
                " так тільки вище FL275, в межах сектру DVS;\n" +
                "-\n" +
                " ні;\n" +
                "-\n" +
                " за рішенням КП РДЦ;\n" +
                "-\n" +
                " застосовуються за будь-яких умов;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Дайте визначення терміну небезпечна зона:\n" +
                "+\n" +
                " частина повітряного простору визначеного розміру, у межах якої може провадитися діяльність, що є небезпечною для польотів повітряних суден у визначені періоди;\n" +
                "-\n" +
                " частина повітряного простору встановлених розмірів над територією або територіальними водами України, у межах якої (яких) польоти ПС заборонені;\n" +
                "-\n" +
                " частина повітряного простору встановлених розмірів над територією або територіальними водами України, в межах якої (яких) польоти повітряних суден обмежуються відповідно до визначених умов;\n" +
                "-\n" +
                " частина повітряного простору навколо зон обмеження польотів, небезпечних зон, заборонених зон та зон тимчасово зарезервованого повітряного простору, яка призначена для забезпечення вимог щодо безпеки у разі одночасного провадження діяльності з ВПП у зазначених зонах та поза їх межами;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "Яке скорочення встановлено для терміну буферна зона для планування польотів повітряних суден (Flight Planning Buffer Zone)?\n" +
                "+\n" +
                " FBZ;\n" +
                "-\n" +
                " TRA;\n" +
                "-\n" +
                " TSA;\n" +
                "-\n" +
                " UKP;\n" +
                "\n" +
                "\n" +
                "##theme 13\n" +
                "##score 1\n" +
                "##type 1\n" +
                "##time 0:00:00\n" +
                "У яких частинах повітряного простору забезпечується диспетчерське обслуговування?\n" +
                "+\n" +
                " CTA, UTA, TMA;\n" +
                "-\n" +
                " TRA/TSA;\n" +
                "-\n" +
                " FIZ;\n" +
                "-\n" +
                " UKP;\n" +
                "\n";
        readFileSD_old(filepathold);

    }

    static void readFileSD(String filePath) {

        //br=filePath;
        String str = filePath;
        // читаем содержимое
        boolean next_question = false;
        boolean standby_for_question = false;
        int count_questions = 0;
        int Alllines = 0, thatlines = 0;
        String str_count = filePath;
        while (str_count.contains("\n")) {
            str_count = str_count.substring(str_count.indexOf("\n") + 1);
            Alllines++;
            //System.out.println(str_count.);
        }
        if (str_count.length() != 0) Alllines++;
        thatlines = Alllines;
        System.out.println("Alllines" + Alllines);
        while (thatlines >= 0) {
            int n_index = str.indexOf("\n");
            String str_n_found;
            if (n_index != -1) {
                str_n_found = str.substring(0, n_index);
                str = str.substring(n_index + 1);
            } else {
                str_n_found = str;
            }
            thatlines--;
            System.out.println("thatlines" + thatlines);
            while (str_n_found.startsWith(" ")) {//что бы убрать все пробелы перед вопросом
                str_n_found = str_n_found.substring(1);
            }
            if (str_n_found.startsWith("+")) {
                //RIGHT ANSWER
                String right_ansver = str_n_found.substring(1);
                //System.out.println("\n Right answer:" + right_ansver + "\n");
                RAnswer = right_ansver;
                NAnswers.add(right_ansver);
                // if (standby_for_question) {
                //     //System.out.println("\nERROR to many right variants\n");
                // }
                //standby_for_question = true;
            } else if ((next_question) || (count_questions == 0)) {
                if (!str_n_found.isEmpty()) {
                    count_questions++;
                    //standby_for_question = false;
                    //QUESTION
                    //System.out.println("\n Question:" + str_n_found + "END\n");
                    Question_is = str_n_found;
                    next_question = false;

                    NAnswers.clear();
                    RAnswer = null;
                }
            } else if (str_n_found.isEmpty()) {
                next_question = true;
            } else {
                //NEGATIVE ANSWER
                NAnswers.add(str_n_found);
                //System.out.println("\n NAnswer:" + str_n_found + "END\n");
            }
            if ((NAnswers.size() > 0 && (!Question_is.equals("")) && (RAnswer != null)) && ((next_question) || (thatlines == 0))) {
                System.out.println("\n Question_is:" + Question_is + "\n");
                System.out.println("\n RAnswer:" + RAnswer + "\n");
                System.out.println("\n NAnswers:" + NAnswers.toString() + "\n");
                //sendValues();
            }

        }

        //Toast.makeText(activity, "Новые вопросы импортированы" + count_questions, Toast.LENGTH_SHORT).show();

    }

    private static String Substring_brakets(String str) {
        str = str.substring(str.indexOf(")") + 1);
        while (str.startsWith(" ")) {
            str = str.substring(1);
        }
        return str;
    }


    static void readFileSD_old(String filePath) {
        String str = filePath;
        // читаем содержимое
        boolean next_question = false;
        boolean standby_for_question = false;
        int count_questions = 0;
        int Alllines = 0, thatlines = 0;
        int problem_question=-1;
        String str_count = filePath;
        while (str_count.contains("\n")) {
            str_count = str_count.substring(str_count.indexOf("\n") + 1);
            Alllines++;
            // System.out.println(str_count);
        }
        if (str_count.length() != 0) Alllines++;
        thatlines = Alllines;
        System.out.println("Alllines" + Alllines);
        int what_is_next = -1;
        RAnswer = null;
        while (thatlines >= 0) {

            int n_index = str.indexOf("\n");
            String str_n_found;
            if (n_index != -1) {
                str_n_found = str.substring(0, n_index);
                str = str.substring(n_index + 1);
            } else {
                str_n_found = str;
            }
            thatlines--;
            //System.out.println("thatlines" + thatlines);
            while (str_n_found.startsWith(" ")) {//что бы убрать все пробелы перед вопросом
                str_n_found = str_n_found.substring(1);
            }
            switch (what_is_next) {
                case 0://Question
                    Question_is = str_n_found;
                    NAnswers.clear();
                    RAnswer = null;
                    count_questions++;
                    break;
                case 1://RightAnswer
                    String right_ansver = str_n_found;
                    if (RAnswer==null) {
                        RAnswer = right_ansver;
                    }else{
                        problem_question = count_questions;
                    }
                    NAnswers.add(right_ansver);
                    break;
                case 2://Ansers
                    NAnswers.add(str_n_found);
                    break;
                case 3:
                    //clear_send_values = 1;
                    break;
            }
            if (str_n_found.contains("00:00")) {//next Question
                what_is_next=0;
            } else if (str_n_found.equals("+")) {//nextRightAnswer
                what_is_next = 1;
            } else if (str_n_found.equals("-")) {//nextAnsers
                what_is_next = 2;
            } else if (str_n_found.isEmpty()) {
                what_is_next = 3;
            } else {
                what_is_next = -1;
            }
            if ((RAnswer!=null)&&(problem_question==-1)&&((what_is_next == 0) || (thatlines == 0))) {
                System.out.println("\n Question_is:" + Question_is + "\n");
                System.out.println("\n RAnswer:" + RAnswer + "\n");
                System.out.println("\n NAnswers:" + NAnswers.toString() + "\n");
                System.out.println("вопросо"+count_questions);
                //sendValues();
            }
            if (problem_question!=-1){
                //sendProblem(count_questions);
                break;
            }

        }
        System.out.println("вопросов"+count_questions);
        // Toast.makeText(activity, "Новые вопросы импортированы по старому" + count_questions, Toast.LENGTH_SHORT).show();
    }

    private static void readFileSD_Meteo(String filepath2) {
        //br=filePath;
        String str = filepath2;
        // читаем содержимое
        String AllText;
        boolean next_question = false;
        boolean standby_for_question = false;
        int count_questions = 0;
        List<String> Answers = new ArrayList<>();

        while ((!str.isEmpty())) {
            String str_n_found;
            int n_index = str.indexOf("\n");
            if (n_index < 0) {
                break;
            } else {
                str_n_found = str.substring(0, n_index);
            }
            str = str.substring(n_index + 1);

            if (str_n_found.isEmpty()) {
                str = str.substring(str.indexOf("\n") + 1);
                continue;
            }
            while (str_n_found.startsWith(" ")) {
                str_n_found = str_n_found.substring(1);
            }
            String str_question_begin = str_n_found.length() > 2 ? str_n_found.substring(0, 2) : "";
            //System.out.println("\nAnswers:" + str_question_begin + "\n");
            boolean RA_found = false;
            if (str_question_begin.contains(")")) {
                for (int i = 0; i < Answers.size(); i++) {
                    String check = Answers.get(i);
                    if (check.substring(0, 2).equals(str_question_begin)) {
                        String right_answer = str_n_found;
                        Answers.remove(Answers.get(i));
                        right_answer = Substring_brakets(right_answer);


                        Answers.add(right_answer);
                        System.out.println("\nRAnswer:" + right_answer + "\n");
                        RAnswer = right_answer;
                        //Answers.clear();
                        RA_found = true;
                    }
                }
                if (!RA_found) {
                    Answers.add(str_n_found);
                    //System.out.println("\nAnswers:" + str_n_found + "\n");
                } else {
                    List<String> Answers_List = new ArrayList<>();
                    for (int i = 0; i < Answers.size(); i++) {
                        String answer = Substring_brakets(Answers.get(i));
                        Answers_List.add(answer);
                    }
                    Answers.clear();
                    System.out.println("\nAnswers_List:" + Answers_List + "\n");
                    NAnswers.clear();
                    NAnswers.addAll(Answers_List);
                    Answers_List.clear();
                    ///

                }
            } else {
                //System.out.println("\nQuestion:" + str_n_found + "\n");
                Question_is = str_n_found;
                if ((NAnswers.size() > 0 && (!Question_is.equals("")) && (!RAnswer.equals("")))) {
                    System.out.println("\n Question_is:" + Question_is + "\n");
                    System.out.println("\n RAnswer:" + RAnswer + "\n");
                    System.out.println("\n NAnswers:" + NAnswers.toString() + "\n");
                    //sendValues();
                } else {
                    System.out.println("\n EEEEEEEEEERRRROR Question_is:" + Question_is + "\n");
                    System.out.println("\n EEEEEEEEEERRRROR RAnswer:" + RAnswer + "\n");
                    System.out.println("\n EEEEEEEEEERRRROR NAnswers:" + NAnswers.toString() + "\n");
                }
                //System.out.println("\n countQuestion:" + count_questions+ "\n");
                count_questions++;
                Answers.clear();

            }

            //int n_index = str.indexOf(")");
        }
        //System.out.println("\nEND:" + "\n");
    }

    // convert UTF-8 to internal Java String format
    public static String convertUTF8ToString(String s) {
        String out = null;
        try {
            out = new String(s.getBytes("ISO-8859-1"), "windows-1251");
        } catch (java.io.UnsupportedEncodingException e) {
            return null;
        }
        return out;
    }

    // convert internal Java String format to UTF-8
    public static String convertStringToUTF8(String s) {
        String out = null;
        try {
            out = new String(s.getBytes("windows-1251"), "ISO-8859-1");
        } catch (java.io.UnsupportedEncodingException e) {
            return null;
        }
        return out;
    }


}
